src/Catalogs/ПодписиПисем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>ПодписиПисем</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВключатьПодписьДляНовыхСообщений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьПодписьПриОтветеИлиПересылке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписьПриОтветеФорматированныйДокумент</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписьДляНовыхФорматированныйДокумент</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецПодписи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/ОсновныеПодписиПисем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ОсновныеПодписиПисем</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Подпись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодписиПисем</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/ПодписиПисем/Forms/ФормаВыбора/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьСписокПодписейНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьСписокПодписейНаСервере()
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
	"ВладелецПодписи", Пользователи.ТекущийПользователь(), , , Истина);
	
КонецПроцедуры

&НаСервере
Процедура ИспользоватьКакОсновнуюНаСервере(СтруктураПараметров)
	
	Запись = РегистрыСведений.ОсновныеПодписиПисем.СоздатьМенеджерЗаписи();
	Запись.Пользователь = СтруктураПараметров.Пользователь;
	Запись.УчетнаяЗапись = СтруктураПараметров.УчетнаяЗапись;
	Запись.Подпись = СтруктураПараметров.Подпись;
	
	Запись.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьКакОсновную(Команда)
	
	Если НЕ КомандаИспользоватьКакОсновнуюДоступна() Тогда
		Возврат;
	КонецЕсли;
	
	НовыйОсновнаяПодпись = Элементы.Список.ТекущиеДанные.Ссылка;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Пользователь", Элементы.Список.ТекущиеДанные.ВладелецПодписи);
	СтруктураПараметров.Вставить("УчетнаяЗапись", Элементы.Список.ТекущиеДанные.УчетнаяЗапись);
	СтруктураПараметров.Вставить("Подпись", НовыйОсновнаяПодпись);
	
	ИспользоватьКакОсновнуюНаСервере(СтруктураПараметров);
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Функция КомандаИспользоватьКакОсновнуюДоступна()
	
	Если ТипЗнч(Элементы.Список.ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка")
		Или Элементы.Список.ТекущиеДанные = Неопределено
		Или Элементы.Список.ТекущиеДанные.ЭтоОсновная
		Или Элементы.Список.ТекущиеДанные.ПометкаУдаления Тогда
		
		Возврат Ложь;
		
	КонецЕсли;

	Возврат Истина;
	
КонецФункции

#КонецОбласти
